#Область ОбработчикиКомандформы

&НаКлиенте
Процедура Печать(Команда)
	
	УправлениеПечатьюКлиент.ПечатьДокументов(СформироватьКоллекциюПечатныхФорм());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
функция СформироватьКоллекциюПечатныхФорм()
	
	КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм("ШаблонВнешнейПечатнойФормы");
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(СсылкаНаОбъект);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(МассивОбъектов,
		КоллекцияПечатныхФорм,
		Новый СписокЗначений,
		Неопределено);
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(КоллекцияПечатныхФорм);
	
КонецФункции

#КонецОбласти